public class Runner1 {
    public static void main(String[] args) {
        //Задание 1
        //- Дана строка: «СегоДНЯ ОченЬ ХороШАя ПоГоДа»
        //- Привести строку к нижнему регистру.

        String str = "СегоДНЯ ОченЬ ХороШАя ПоГоДа";
        str = str.toLowerCase();
        System.out.println(str);
    }
}
